# work_03 全国名産品都道府県当てクイズ
# リストからランダムで抽出する
import random

dc = {
    "北海道": "じゃがいも",
    "青森県": "りんご",
    "岩手県": "わんこそば",
    "宮城県": "牛タン",
    "秋田県": "きりたんぽ",
    "山形県": "さくらんぼ",
    "福島県": "桃",
    "茨城県": "納豆",
    "栃木県": "いちご",
    "群馬県": "こんにゃく",
    "埼玉県": "草加せんべい",
    "千葉県": "落花生",
    "東京都": "もんじゃ焼き",
    "神奈川県": "小田原かまぼこ",
    "新潟県": "コシヒカリ",
    "富山県": "ます寿司",
    "石川県": "金箔",
    "福井県": "越前ガニ",
    "山梨県": "ぶどう",
    "長野県": "そば",
    "岐阜県": "朴葉味噌",
    "静岡県": "うなぎパイ",
    "愛知県": "味噌カツ",
    "三重県": "伊勢エビ",
    "滋賀県": "鮒寿司",
    "京都府": "八ツ橋",
    "大阪府": "たこ焼き",
    "兵庫県": "明石焼",
    "奈良県": "柿の葉寿司",
    "和歌山県": "梅干し",
    "鳥取県": "梨（二十世紀梨）",
    "島根県": "出雲そば",
    "岡山県": "白桃",
    "広島県": "牡蠣",
    "山口県": "ふぐ",
    "徳島県": "すだち",
    "香川県": "うどん",
    "愛媛県": "みかん",
    "高知県": "かつおのたたき",
    "福岡県": "明太子",
    "佐賀県": "呼子のイカ",
    "長崎県": "カステラ",
    "熊本県": "馬刺し",
    "大分県": "とり天",
    "宮崎県": "マンゴー",
    "鹿児島県": "黒豚",
    "沖縄県": "ゴーヤーチャンプルー",
}


# リストに変換してrandom.choiceを使う
# ランダムで問題１問を選ぶ処理を関数にする
def choice(dc):
    prefecture, product = random.choice(list(dc.items()))

    question = product
    answer = prefecture
    return question, answer  # 戻り値(return)


total = 0  # 問題数カウント
correct = 0  # 正解数カウント

# 基本クイズは繰り返されるようにし、解答に exit と入力された場合にはゲームを終了
print("終了したいときは『exit』と入力してください。")

while True:

    q, a = choice(dc)
    kotae = input(f"{q}はどこの都道府県の名産品でしょう？:")

    if kotae.lower() == "exit":
        print("ゲームを終了します。お疲れ様でした！")
        print(f"正解率：{(correct / total * 100):.1f}%")
        break

    total += 1
    if kotae == a:
        print("正解！")
        correct += 1
    else:
        print(f"残念！正解は {a} です。")
